'use client'
import styles from './Promotion.module.css'

export default function Promotion({ }) {

    return (
        <>
            <ol style={{ listStyleType: 'decimal', paddingLeft: '1.5rem' }}>
                <li>
                    ส่วนลดต่อประกันก่อนหมดอายุ สูงสุด 646 บาท
                </li>
                <li>
                    บริการช่วยเหลือฉุกเฉิน 24 ชม.จาก Claim Di เลือกใช้บริการอย่างใดอย่างหนึ่ง ให้สิทธิ์ได้ปีละ 1 ครั้ง เช่น รถยก/รถลาก, จั๊มแบตเตอรี่, เติมน้ำมันฉุกเฉิน, และช่างกุญแจ โดยสามารถติดต่อผ่าน เบอร์ 02-021-1679 (สำหรับบริษัทประกันที่ไม่มีบริการช่วยเหลือฉุกเฉินเท่านั้น) และมีบริการ ประสานงานต่างๆ ซึ่งลูกค้าเป็นผู้รับผิดชอบค่าใช้จ่ายเองค่ะ
                    <ol className={styles.decimallist}>
                        <li>ช่วยเหลือฉุกเฉินทางการแพทย์</li>
                        <li>ประสานงานรับแจ้งเหตุด่วน เหตุร้าย กับเจ้าหน้าที่ตำรวจทั่วประเทศ</li>
                        <li>ประสานงานบริษัทประกันในการเคลมอุบัติเหตุ</li>
                        <li>ประสานงานจองโรงแรม ร้านอาหาร ตั๋วเครื่องบิน รถเช่า</li>
                        <span className="text-red">*** ซึ่งลูกค้าเป็นผู้รับผิดชอบค่าใช้จ่ายเองค่ะ</span>
                    </ol>
                </li>
                <li>
                บริการรถใช้ระหว่างซ่อมฟรี 3 วัน หรือเงินค่าเดินทาง 1,000 บาท สำหรับเบี้ยประกัน 12,000 บาทขึ้นไป กรณีแจ้งเคลมเป็นฝ่ายถูกและติดต่อใช้สิทธิ์ภายใน 30 วัน นับจากวันที่แจ้งเคลม โดยใช้สิทธิ์ได้ปีละ 1 ครั้ง ต่อ 1 อายุกรมธรรม์
                </li>
                <li>
                รับประกันคืนเงิน 100% หรือชดเชยส่วนต่างหลังต่อประกันไปแล้ว ภายใน 14 วัน หากพบที่อื่นถูกกว่าบนความคุ้มครองที่เท่ากัน
                </li>
            </ol>
        </>
    );
}